package ru.julia;

/**
 * В его запасе 100 килограммов гречки. Хранение одного килограмма в месяц стоит 100 рублей.
 * Плата вносится за месяц вперёд. За месяц Василий съедает примерно 6 килограммов гречки.
 * Каждый месяц Василий платит за хранение остатка. То есть в первый месяц от заплатит за 100 килограммов,
 * второй месяц за 94 и так далее, пока гречка не закончится.
 * Написать программу, которая посчитает сколько денег нужно будет Василию, чтобы оплатить хранение гречки,
 * до того момента, как он её съест.
 * Со звёздочкой. В начале задавать в переменной не сколько килограммов запас Василий, а в течение какого
 * срока он хочет питаться гречкой и рассчитывать остальное исходя из этого.
 */
public class ZapasyGrechki {
    public static void main(String[] args) {

    }
}
